In [1]:
import pandas as pd

<h1>Pandas series</h1>

**Creating a pandas series**

In [5]:
group=pd.Series(data=[3.97,3.81,3.65],index=['Joy','Omi','Bless'])
print(group)

Joy      3.97
Omi      3.81
Bless    3.65
dtype: float64

**Alternative of Creating a pandas series**

In [6]:
group=pd.Series([3.97,3.81,3.65],['Joy','Omi','Bless'])
print(group)

Joy      3.97
Omi      3.81
Bless    3.65
dtype: float64

## It has to be noted that a pandas series can hold multiple types of data

**We can know the index of a series using the .series function**

In [7]:
group.index

Index(['Joy', 'Omi', 'Bless'], dtype='object')

**If we want to know the value of an index we can use Series name[index] function**

In [8]:
group['Omi']

3.81

**the .loc function also has the same result as the previous one**

In [10]:
group.loc['Omi']

3.81

**the same methods can be used to locate multiple values by wrapping the values in [ ]**

In [15]:
group[['Joy','Omi']]

Joy    3.97
Omi    3.81
dtype: float64

**We can get values using numeric index as well**

In [18]:
group[[0,1]]

Joy    3.97
Omi    3.81
dtype: float64

**we can use the in method to see if one value is in the pandas series or not**

In [19]:
'Joy' in group

True

In [20]:
'Raktim' in group

False

**we can perform python math or operator functions in pandas series**

In [21]:
group*2

Joy      7.94
Omi      7.62
Bless    7.30
dtype: float64

In [22]:
group**2

Joy      15.7609
Omi      14.5161
Bless    13.3225
dtype: float64

<h1>Pandas Dataframe</h1>

In [53]:
inf={'age': pd.Series([16,23,22],['Ayon','Nibir','Fazlu']),
    'height': pd.Series([5.6,5.8,5.7],['Ayon','Nibir','Fazlu'])}

In [54]:
shompriti=pd.DataFrame(inf)
shompriti

       age  height
Ayon    16     5.6
Nibir   23     5.8
Fazlu   22     5.7

<h4>getting coloumns</h4>

In [56]:
shompriti['height']

Ayon     5.6
Nibir    5.8
Fazlu    5.7
Name: height, dtype: float64

In [1]:
import pandas as pd

<h2>we can read many files of many types with p.read function in pandas

In [17]:
flicks=pd.read_csv('movies.csv',sep=',')
flicks.head(15)

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy
5,6,Heat (1995),Action|Crime|Thriller
6,7,Sabrina (1995),Comedy|Romance
7,8,Tom and Huck (1995),Adventure|Children
8,9,Sudden Death (1995),Action
9,10,GoldenEye (1995),Action|Adventure|Thriller
10,11,"American President, The (1995)",Comedy|Drama|Romance
11,12,Dracula: Dead and Loving It (1995),Comedy|Horror
12,13,Balto (1995),Adventure|Animation|Children
13,14,Nixon (1995),Drama
14,15,Cutthroat Island (1995),Action|Adventure|Romance

In [20]:
ratings_flicks=pd.read_csv('ratings.csv',sep=',')
ratings_flicks.head(10)

   userId  movieId  rating   timestamp
0       1        2     3.5  1112486027
1       1       29     3.5  1112484676
2       1       32     3.5  1112484819
3       1       47     3.5  1112484727
4       1       50     3.5  1112484580
5       1      112     3.5  1094785740
6       1      151     4.0  1094785734
7       1      223     4.0  1112485573
8       1      253     4.0  1112484940
9       1      260     4.0  1112484826

In [23]:
tags=pd.read_csv('tags.csv',sep=',')
tags.head(15)

    userId  movieId                tag   timestamp
0       18     4141        Mark Waters  1240597180
1       65      208          dark hero  1368150078
2       65      353          dark hero  1368150079
3       65      521      noir thriller  1368149983
4       65      592          dark hero  1368150078
5       65      668          bollywood  1368149876
6       65      898   screwball comedy  1368150160
7       65     1248      noir thriller  1368149983
8       65     1391               mars  1368150055
9       65     1617           neo-noir  1368150217
10      65     1694              jesus  1368149925
11      65     1783      noir thriller  1368149983
12      65     2022              jesus  1368149925
13      65     2193             dragon  1368151314
14      65     2353  conspiracy theory  1368151266

<h3>we can find rows and information about the rows by using .iloc[index] function and print it out by storing it into a variable

In [34]:
row_0=tags.iloc[0]
type(row_0)

pandas.core.series.Series

In [35]:
print(row_0)

userId              18
movieId           4141
tag        Mark Waters
Name: 0, dtype: object

<h3>We can see what indexes are there in a row or what kind of information there is in a row using .index function

In [36]:
row_0.index

Index(['userId', 'movieId', 'tag'], dtype='object')

<h3>We can also know what data each index has by stating the assigned variable name of the row and passing in the index name inside[ ]

In [39]:
row_0['userId']

18

<h3>We can also dtermine if one type of index is actually on the row using 'index name' in 'row variable'

In [40]:
'ratings'in row_0

False

In [41]:
tags.columns

Index(['userId', 'movieId', 'tag'], dtype='object')

In [42]:
tags.index

RangeIndex(start=0, stop=465564, step=1)

<h3>we can extract multiple or a series of rows using the .iloc[ [] ]

In [46]:
tags.iloc[[0,40,100]]

     userId  movieId          tag
0        18     4141  Mark Waters
40       96   106696          Ice
100     121    52973        drugs